<script setup>
import userData from "../../components/data-sidebar/user-data.vue";
</script>

<template>
  <div class="font-bold text-[20px]">หน้าหลัก</div>
  <div class="grid grid-cols-12 col-span-12 gap-4 pt-[20px]">
    <div
      class="col-span-3 px-[10px] py-[10px] bg-white border-l-[5px] border-[#1BBE0D] rounded-md flex items-center"
    >
      <div class="grid grid-cols-10 items-center">
        <svg
          class="inline"
          width="30"
          height="30"
          viewBox="0 0 668 668"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M0.666748 334C0.666748 149.905 149.905 0.666992 334 0.666992C518.093 0.666992 667.333 149.905 667.333 334C667.333 518.094 518.093 667.334 334 667.334C149.905 667.334 0.666748 518.094 0.666748 334ZM457.57 243.763C470.587 256.781 470.587 277.887 457.57 290.904L334.81 413.664C315.953 432.52 285.38 432.52 266.523 413.664L210.43 357.57C197.412 344.554 197.412 323.447 210.43 310.43C223.447 297.414 244.553 297.414 257.57 310.43L300.667 353.527L410.43 243.763C423.447 230.746 444.553 230.746 457.57 243.763Z"
            fill="#1BBE0D"
          />
        </svg>

        <div class="inline col-span-5 pl-[10px]">กำลังใช้งาน</div>
        <div class="justify-self-end col-span-4">
          <div class="inline text-gray-500 pr-[5px]">จำนวน :</div>
          <div class="inline col-span-2">100</div>
        </div>
      </div>
    </div>

    <div
      class="col-span-3 px-[10px] py-[10px] bg-white border-l-[5px] border-[#FF0000] rounded-md flex items-center"
    >
      <div class="grid grid-cols-10 items-center">
        <svg
          class="inline"
          width="30"
          height="30"
          viewBox="0 0 642 597"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M287.667 330.334C287.667 348.744 302.59 363.667 321 363.667C339.41 363.667 354.333 348.744 354.333 330.334V230.334C354.333 211.924 339.41 197 321 197C302.59 197 287.667 211.924 287.667 230.334V330.334ZM354.333 429.96C354.333 411.55 339.41 396.627 321 396.627C302.59 396.627 287.667 411.55 287.667 429.96V430.334C287.667 448.744 302.59 463.667 321 463.667C339.41 463.667 354.333 448.744 354.333 430.334V429.96ZM233.578 52.3791C271.68 -16.2019 370.31 -16.2019 408.41 52.3791L628.443 448.437C665.47 515.09 617.273 597 541.027 597H100.962C24.713 597 -23.4837 515.09 13.5457 448.437L233.578 52.3791Z"
            fill="#FF0000"
          />
        </svg>

        <div class="inline col-span-5 pl-[10px]">ใช้งานไม่ได้</div>
        <div class="justify-self-end col-span-4">
          <div class="inline text-gray-500 pr-[5px]">จำนวน :</div>
          <div class="inline col-span-2">100</div>
        </div>
      </div>
    </div>

    <div
      class="col-span-3 px-[10px] py-[10px] bg-white border-l-[5px] border-[#FFD600] rounded-md flex items-center"
    >
      <div class="grid grid-cols-10 items-center">
        <svg
          class="inline"
          width="30"
          height="30"
          viewBox="0 0 668 601"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M667.33 117.666C667.33 131.557 667.493 143.37 665.41 153.842C657.517 193.51 626.51 224.52 586.84 232.411C577.077 234.354 566.15 234.344 553.46 234.333C407.153 234.218 260.842 234.218 114.534 234.333C101.844 234.344 90.9163 234.354 81.1547 232.411C41.4857 224.52 10.476 193.51 2.58533 153.842C0.502335 143.37 0.663669 131.557 0.663669 117.666C0.663669 103.775 0.502335 91.9615 2.58533 81.4898C10.476 41.8208 41.4857 10.8112 81.1547 2.92051C90.9163 0.978844 101.844 0.987506 114.534 0.997506C260.842 1.11417 407.153 1.11417 553.46 0.997506C566.15 0.987506 577.077 0.978844 586.84 2.92051C626.51 10.8112 657.517 41.8208 665.41 81.4898C667.493 91.9615 667.33 103.775 667.33 117.666ZM34 436.523V249.81C46.4057 256.974 60.088 262.204 74.6443 265.1C87.701 267.697 101.538 267.68 113.022 267.667L114.554 267.663C260.844 267.547 407.137 267.547 553.427 267.663L554.957 267.667C566.44 267.68 580.28 267.697 593.337 265.1C607.9 262.204 621.59 256.97 634 249.8V436.523C634.003 466.073 634.003 491.533 631.263 511.923C628.323 533.773 621.7 554.72 604.71 571.707C587.723 588.697 566.777 595.32 544.927 598.26C524.537 601 499.077 601 469.527 600.997H198.472C168.923 601 143.462 601 123.074 598.26C101.223 595.32 80.2783 588.697 63.2893 571.707C46.3007 554.72 39.676 533.773 36.7383 511.923C33.997 491.533 33.9983 466.073 34 436.523ZM234 301C215.591 301 200.667 315.923 200.667 334.333C200.667 352.743 215.591 367.667 234 367.667H434C452.41 367.667 467.333 352.743 467.333 334.333C467.333 315.923 452.41 301 434 301H234Z"
            fill="#FFD600"
          />
        </svg>

        <div class="inline col-span-5 pl-[10px]">สต็อก</div>
        <div class="justify-self-end col-span-4">
          <div class="inline text-gray-500 pr-[5px]">จำนวน :</div>
          <div class="inline col-span-2">100</div>
        </div>
      </div>
    </div>

    <div
      class="col-span-3 px-[10px] py-[10px] bg-white border-l-[5px] border-[#DB00FF] rounded-md flex items-center"
    >
      <div class="grid grid-cols-10 items-center">
        <svg
          class="inline"
          width="30"
          height="30"
          viewBox="0 0 800 632"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M184 24H776C789.255 24 800 34.7453 800 48C800 61.2547 789.255 72 776 72H184C170.745 72 160 61.2547 160 48C160 34.7453 170.745 24 184 24ZM184 200H776C789.255 200 800 210.745 800 224C800 237.255 789.255 248 776 248H184C170.745 248 160 237.255 160 224C160 210.745 170.745 200 184 200ZM184 384H776C789.255 384 800 394.745 800 408C800 421.255 789.255 432 776 432H184C170.745 432 160 421.255 160 408C160 394.745 170.745 384 184 384ZM184 560H776C789.255 560 800 570.745 800 584C800 597.255 789.255 608 776 608H184C170.745 608 160 597.255 160 584C160 570.745 170.745 560 184 560ZM48 96C21.4906 96 0 74.5094 0 48C0 21.4906 21.4906 0 48 0C74.5094 0 96 21.4906 96 48C96 74.5094 74.5094 96 48 96ZM48 272C21.4906 272 0 250.509 0 224C0 197.491 21.4906 176 48 176C74.5094 176 96 197.491 96 224C96 250.509 74.5094 272 48 272ZM48 456C21.4906 456 0 434.509 0 408C0 381.491 21.4906 360 48 360C74.5094 360 96 381.491 96 408C96 434.509 74.5094 456 48 456ZM48 632C21.4906 632 0 610.509 0 584C0 557.491 21.4906 536 48 536C74.5094 536 96 557.491 96 584C96 610.509 74.5094 632 48 632Z"
            fill="#DB00FF"
          />
        </svg>

        <div class="inline col-span-5 pl-[10px]">อื่นๆ</div>
        <div class="justify-self-end col-span-4">
          <div class="inline text-gray-500 pr-[5px]">จำนวน :</div>
          <div class="inline col-span-2">100</div>
        </div>
      </div>
    </div>
  </div>

  <div class="grid grid-cols-12 gap-4">
    <div class="col-span-12 rounded-lg">
      <userData />
    </div>
    <!-- <div class="col-span-6">
      <userData />
    </div> -->
  </div>
</template>

<style lang="scss" scoped></style>
