<template>
  <div class="grid grid-cols-12">
    <div class="grid grid-cols-12 py-[15px]">
      <button class="bg-[#184BCE] rounded-[10px] px-[10px] py-[16px] col-span-9">
        <div class="grid grid-cols-5">
          <svg
            width="24"
            height="21"
            viewBox="0 0 24 21"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M2.00457 9.01385H22.0325C22.2981 9.01385 22.5528 9.11936 22.7406 9.30716C22.9284 9.49496 23.0339 9.74966 23.0339 10.0153C23.0339 10.2808 22.9284 10.5355 22.7406 10.7233C22.5528 10.9111 22.2981 11.0166 22.0325 11.0166H2.00457C1.73898 11.0166 1.48427 10.9111 1.29648 10.7233C1.10868 10.5355 1.00317 10.2808 1.00317 10.0153C1.00317 9.74966 1.10868 9.49496 1.29648 9.30716C1.48427 9.11936 1.73898 9.01385 2.00457 9.01385Z"
              fill="white"
            />
            <path
              d="M2.41928 10.0157L10.7252 18.3197C10.9133 18.5077 11.0189 18.7628 11.0189 19.0287C11.0189 19.2946 10.9133 19.5497 10.7252 19.7377C10.5372 19.9258 10.2822 20.0314 10.0162 20.0314C9.75029 20.0314 9.49525 19.9258 9.3072 19.7377L0.294212 10.7247C0.200951 10.6317 0.126959 10.5212 0.0764728 10.3995C0.0259872 10.2779 0 10.1474 0 10.0157C0 9.88398 0.0259872 9.75355 0.0764728 9.63188C0.126959 9.51022 0.200951 9.3997 0.294212 9.30668L9.3072 0.293686C9.49525 0.105642 9.75029 0 10.0162 0C10.2822 0 10.5372 0.105642 10.7252 0.293686C10.9133 0.481731 11.0189 0.736774 11.0189 1.00271C11.0189 1.26864 10.9133 1.52369 10.7252 1.71173L2.41928 10.0157Z"
              fill="white"
            />
          </svg>
          <router-link to="/Look-social" class="text-[18px] text-[white] col-span-4 text-center">ย้อนกลับ</router-link>
        </div>
      </button>
    </div>
    <div class="text-[30px] col-start-5 col-span-4 text-center">อุปกรณ์คอมพิวเตอร์</div>
    <div
        class="grid grid-cols-12 col-span-3  col-start-10 justify-end text-end justify-text-end"
      >
      <div class="py-[20px] col-span-3 col-start-4">
        <div class="p-[10px] text-[18px] ">ชื่อผู้ใช้ :</div>
        </div>
        <div class="py-[20px] col-span-4">
         <select class="w-full rounded-lg border border-[#909090] text-[18px] py-[5px] pl-[14px]" > 
          <option value="">พี่คิว</option>
          <option value="">พี่คิว</option>
          <option value="">พี่คิว</option>
         </select>
        </div>
        <div class="py-[15px] col-span-2">
          <button class="bg-[#3C50FA] rounded-[10px] p-[15px]">
            <svg
              width="20"
              height="20"
              viewBox="0 0 20 20"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M1.66667 0H5.83333C6.75381 0 7.5 0.746192 7.5 1.66667V5.83333C7.5 6.75381 6.75381 7.5 5.83333 7.5H1.66667C0.746192 7.5 0 6.75381 0 5.83333V1.66667C0 0.746192 0.746192 0 1.66667 0ZM1.66667 9.16667H5.83333C6.75381 9.16667 7.5 9.91283 7.5 10.8333V18.3333C7.5 19.2538 6.75381 20 5.83333 20H1.66667C0.746192 20 0 19.2538 0 18.3333V10.8333C0 9.91283 0.746192 9.16667 1.66667 9.16667ZM10.8333 0H18.3333C19.2538 0 20 0.746192 20 1.66667V10.8333C20 11.7538 19.2538 12.5 18.3333 12.5H10.8333C9.91283 12.5 9.16667 11.7538 9.16667 10.8333V1.66667C9.16667 0.746192 9.91283 0 10.8333 0ZM10.8333 14.1667H18.3333C19.2538 14.1667 20 14.9128 20 15.8333V18.3333C20 19.2538 19.2538 20 18.3333 20H10.8333C9.91283 20 9.16667 19.2538 9.16667 18.3333V15.8333C9.16667 14.9128 9.91283 14.1667 10.8333 14.1667Z"
                fill="white"
              />
            </svg>
          </button>
        </div>
      </div>
  </div>
</template>

<script setup></script>
